toto/app/controllers/productions_controller.rb

  def index
    @productions = Production.all
---
SELECT "productions".* FROM "productions"

  def create
    @production = Production.new(production_params)
    respond_to do |format|
      if @production.save
---
INSERT INTO "productions" ("productionType", "created_at", "updated_at") VALUES (?, ?, ?)  [["productionType", "toto"], ["created_at", "2016-03-09 03:08:51.465052"], ["updated_at", "2016-03-09 03:08:51.465052"]]

  def update
    respond_to do |format|
      if @production.update(production_params)
---
UPDATE "productions" SET "productionType" = ?, "updated_at" = ? WHERE "productions"."id" = ?  [["productionType", "HTML"], ["updated_at", "2016-03-09 06:45:59.049775"], ["id", 3]]

  def destroy
    @production.destroy
---
DELETE FROM "productions" WHERE "productions"."id" = ?  [["id", 1]]

  def destroy_multiple
    unless params[:ids].nil?
        Production.destroy(params[:ids])
---
DELETE FROM "productions" WHERE "productions"."id" = ?  [["id", 3]]

    def set_production
      @production = Production.find(params[:id])
---
SELECT  "productions".* FROM "productions" WHERE "productions"."id" = ? LIMIT 1  [["id", 3]]